Revit 2027 API
NurbsSurfaceData.GetKnotU Method
 Get the knot in the u-direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetKnotU(
	int idx
)
Public Function GetKnotU (
	idx As Integer
) As Double
public:
double GetKnotU(
	int idx
)
member GetKnotU :
        idx : int -> float
Parameters
idx Int32
 The index of the knot.
Return Value
Double
Exceptions
Exception | Condition
ArgumentException |  Out-of-range access.
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace